# Direct Context 3DHandle Settings Visibility Property

Source: https://www.revitapidocs.com/2026/3efddea0-63fb-8440-aead-904f2f393ff2.htm

---

| Direct Context 3DHandle Settings Visibility Property |
| --- |

Visibility of the handle and the associated DirectContext3D graphics.
 A value of true means that the graphics are visible.
**Namespace:** Autodesk.Revit.DB.DirectContext3D
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool Visibility { get; }
```

```
Public ReadOnly Property Visibility As Boolean
	Get
```

```
public:
property bool Visibility {
	bool get ();
}
```

```
member Visibility : bool with get
```

#### Property Value

Boolean See Also

#### Reference

DirectContext3DHandleSettings Class Autodesk.Revit.DB.DirectContext3D Namespace